print('Привет! Задай параметры для квадратного уравнения ax^2+bx+c=0, чтобы определить его корни.')

a = int(input('Введи параметр а =', ))
b = int(input('Введи параметр b =', ))
c = int(input('Введи параметр c =', ))

D = b ** 2 - 4 * a * c

if D < 0:
    print('Дискриминант D =', D, 'Корни отсутсвуют')
elif D == 0:
    print('Дискриминант D =', D, 'Существует 1 корень.')
    x = -b/(2*a)
    print('Корень уравнения x =', x)
elif D > 0:
    print('Дискриминант D =', D, 'Существует 2 корня')
    x1 = (-b - D ** 0.5) / (2 * a)
    x2 = (-b + D ** 0.5) / (2 * a)
    print('x1 = ', x1, 'x2 = ', x2)